import pytest
from main import init_db, add_user, get_user
# Создадим фикстуру.
# Для этого нужно использовать специальный декоратор,
# указывающий на то, что прописанная здесь функция будет являться фикстурой,
# подготавливая тестовую среду и предоставляя ресурсы для этой среды;
#
# Вызовем функцию conn, которая создаст базу данных: init_db,
# а также возвращаем подключение, чтобы с ним можно было работать;
#
# Чтобы остальные функции тоже могли работать с подключением conn, используем yield.
#
# Напоминаем, что yield, как и return, возвращает значения,
# и в этом случае yield будет возвращать объект conn тестам,
# которые будут использовать нашу фикстуру.
# yield позволяет функции временно приостановить свое выполнение,
# пока тесты используют ресурс, который мы им передали;
#
# Закроем подключение.

@pytest.fixture
def db_conn():
   conn = init_db()
   yield conn
   conn.close()

# Мы, по сути, подготовили фикстуру,
# создав базу данных и обеспечив подключение к ней.
# Таким образом, у нас готова необходимая среда, и мы можем переходить
# к выполнению остальных действий. Эта часть служит исключительно для подготовки,
# чтобы можно было продолжить работу с базой данных.
#
# Теперь необходимо создать функции для выполнения тестов:
#
# Создадим функцию test_add_or_get_user для добавления и получения пользователя;
# В круглых скобках указываем фикстуру, которая передает информацию из фикстуры
# в нашу тестовую функцию, в данном случае подключение к базе данных.
# PyTest понимает это автоматически и передает необходимые данные;
# Добавим пользователя с помощью функции add_user;
# Эта функция требует передачи подключения, имени и возраста пользователя,
# поэтому указываем db_conn (подключение), имя и возраст;
# Проверим, есть ли такой пользователь в базе данных:
# создадим переменную user и с помощью функции get запросим из базы данных пользователя
# с указанным именем:
# Сравним информацию с помощью assert
# и в скобках укажем значения имени и возраста для нашего пользователя.
# Таким образом мы проверим,
# соответствует ли значение переменной user ожидаемому результату — кортежу (1, "Sasha", 30).
def test_add_or_get_user(db_conn):
    add_user(db_conn, "Sasha", 30)
    user = get_user(db_conn, "Sasha")
    assert user == (1, "Sasha", 30)
# Запускаем программу, и она показывает,
# что всё работает корректно.
# Теперь наша программа использует фикстуру для подготовки,
# а дальше выполняет свои действия самостоятельно.
# Мы добавляем пользователя, подключаясь к базе данных.
# Эта функция передаёт подключение, которое затем используется.
# Создается курсор, информация добавляется и сохраняется.
# Позже эта информация извлекается из базы данных.
# Фикстуры помогают подготовить среду, создавая базу данных и передавая подключение,
# которое используется в функции.