import sqlite3
# Далее напишем код, в котором:
# создадим функцию init_db для инициализации базы данных;
# создадим подключение к SQLite. В скобках укажем значение memory.
# Прописывая вместо названия файла базы данных значение memory,
# данные будут сохраняться не на диске,
# а только в оперативной памяти и только во время работы программы;
# укажем cursor, с помощью которого мы будем проделывать все действия;
# создадим таблицу user с ее содержимым;
# с помощью return будем возвращать из этой функции подключение (conn).
def init_db():
   conn = sqlite3.connect(':memory:')
   cursor = conn.cursor()
   cursor.execute('''
   CREATE TABLE IF NOT EXISTS users (
   id INTEGER PRIMARY KEY,
   name TEXT,
   age INTEGER)
   ''')
   return conn

# На следующем этапе создадим новую функцию:
# Создаём функцию под названием add_user, которая будет добавлять пользователей.
# В круглых скобках указываем параметры: подключение, имя и возраст;
# Создаем курсор. Затем с помощью метода execute вставляем информацию в таблицу,
# где указываем команду INSERT INTO users (name, age) VALUES (?, ?).
# Вопросительные знаки будут заменены на наши значения, то есть имя и возраст;
# Зафиксируем изменения в базе данных с помощью метода commit, чтобы информация была сохранена.
def add_user(conn, name, age):
   cursor = conn.cursor()
   cursor.execute('''
   INSERT INTO users (name, age) VALUES (?, ?)''', (name, age))
   conn.commit()

# На следующем шаге создадим функцию, которая будет извлекать информацию из нашей базы данных.
# Прописываем функцию get_user.
# В параметрах функции указываем подключение и имя.
# Будем искать пользователя по имени, так как это удобнее, чем поиск по возрасту;
# Создаем объект курсора;
# Используем метод execute, чтобы выполнить SQL-запрос,
# выбирающий данные из базы с помощью select.
# Команда будет выглядеть так: SELECT * FROM users WHERE name=?.
# Вопросительный знак здесь служит параметром, который будет заменён значением имени;
# После выполнения запроса используем метод fetchone для извлечения первой строки результата.
# Если в базе данных есть пользователь с указанным именем, функция вернёт его данные.
def get_user(conn, name):
    cursor = conn.cursor()
    cursor.execute('''SELECT * FROM users WHERE name=?''', (name,))
    return cursor.fetchone()

# Мы прописали всё необходимое для работы с базой данных.
# Переходим к созданию тестовой части с использованием фикстур.
# Для этого импортируем pytest и функции:
